

IDENTIFICATION DIVISION.             
PROGRAM-ID. EAD959DV.                
ENVIRONMENT DIVISION.                
INPUT-OUTPUT SECTION.                
FILE-CONTROL.                        
     SELECT VSAMPAI ASSIGN TO VSAMPAI
        ORGANIZATION IS INDEXED      
        ACCESS  MODE IS DYNAMIC      
        RECORD  KEY  IS ARQ-CHAVE    
        FILE STATUS  IS FS-ARQVSAM.  
DATA DIVISION.                       
FILE SECTION.                        
FD VSAMPAI.                          
01 REG-VSAMPAI.                      
   02 ARQ-CHAVE   PIC X(03).         
   02 ARQ-DADOS   PIC X(30).         
WORKING-STORAGE   SECTION.
WORKING-STORAGE   SECTION.                                  
77 FS-ARQVSAM     PIC 9(2).                                 
PROCEDURE DIVISION.                                         
0001-UNICA  SECTION.                                        
     OPEN I-O  VSAMPAI.                                     
       IF FS-ARQVSAM NOT EQUAL ZEROS                        
         DISPLAY 'ERRO NA ABERTURA DO ARQUIVO VSAMPAI'      
         PERFORM 9999-SAIDA                                 
       END-IF.                                              
       ACCEPT ARQ-CHAVE FROM SYSIN.                         
         READ VSAMPAI.                                      
           IF FS-ARQVSAM NOT EQUAL ZEROS                    
             DISPLAY 'CHAVE ' ARQ-CHAVE  ' - NAO ENCONTRADA'
           ELSE                                             
             DELETE VSAMPAI                                 
              IF FS-ARQVSAM NOT EQUAL ZEROS                 
                 DISPLAY 'NAO DELETADA CHAVE ' ARQ-CHAVE    
              ELSE
                 DISPLAY 'EXCLUIDO - ' REG-VSAMPAI     
           END-IF.                                     
           CLOSE VSAMPAI.                              
             IF FS-ARQVSAM NOT EQUAL ZEROS             
               DISPLAY 'ERRO DE FECHAMENTO ' FS-ARQVSAM
             END-IF.                                   
           PERFORM 9999-SAIDA.                         
9999-SAIDA                 SECTION.                    
    DISPLAY ' FINAL DE PROCESSAMENTO '                 
    STOP RUN.                                                                                               