

IDENTIFICATION DIVISION.             
PROGRAM-ID. EAD959IV.                
ENVIRONMENT DIVISION.                
INPUT-OUTPUT SECTION.                
FILE-CONTROL.                        
     SELECT VSAMPAI ASSIGN TO VSAMPAI
        ORGANIZATION IS INDEXED      
        ACCESS  MODE IS DYNAMIC      
        RECORD  KEY  IS ARQ-CHAVE    
        FILE STATUS  IS FS-ARQVSAM.  
DATA DIVISION.                       
FILE SECTION.                        
FD VSAMPAI.                          
01 REG-VSAMPAI.                      
   02 ARQ-CHAVE   PIC X(03).         
   02 ARQ-DADOS   PIC X(30).         
WORKING-STORAGE   SECTION.
77 FS-ARQVSAM     PIC 9(2).                               
PROCEDURE DIVISION.                                       
0001-UNICA  SECTION.                                      
     OPEN I-O VSAMPAI.                                    
       IF FS-ARQVSAM NOT EQUAL ZEROS                      
         DISPLAY 'ERRO NA ABERTURA DO ARQUIVO VSAMPAI'    
         PERFORM 9999-SAIDA                               
       END-IF.                                            
       ACCEPT REG-VSAMPAI FROM SYSIN.                     
         WRITE REG-VSAMPAI.                               
           IF FS-ARQVSAM NOT EQUAL ZEROS                  
             IF FS-ARQVSAM = 22                           
               DISPLAY 'REGISTRO JA EXISTE'               
               ELSE                                       
                  DISPLAY 'ERRO NA GRAVACAO - ' FS-ARQVSAM
             END-IF                                       
           ELSE
              DISPLAY 'GRAVADO ' REG-VSAMPAI      
           END-IF.                                
           CLOSE VSAMPAI.                         
           IF FS-ARQVSAM NOT EQUAL ZEROS          
             DISPLAY 'ERRO FECHAMENTO ' FS-ARQVSAM
           END-IF.                                
9999-SAIDA                 SECTION.               
    DISPLAY ' FINAL DE PROCESSAMENTO '            
    STOP RUN.                                                                                           