

IDENTIFICATION DIVISION.             
PROGRAM-ID. EAD959VT.                
ENVIRONMENT DIVISION.                
INPUT-OUTPUT SECTION.                
FILE-CONTROL.                        
     SELECT VSAMPAI ASSIGN TO VSAMPAI
        ORGANIZATION IS INDEXED      
        ACCESS  MODE IS SEQUENTIAL   
        RECORD  KEY  IS ARQ-CHAVE    
        FILE STATUS  IS FS-ARQVSAM.  
DATA DIVISION.                       
FILE SECTION.                        
FD VSAMPAI.                          
01 REG-VSAMPAI.                      
   02 ARQ-CHAVE   PIC X(03).         
   02 ARQ-DADOS   PIC X(30).         
WORKING-STORAGE   SECTION.
77 FS-ARQVSAM     PIC 9(2).                           
PROCEDURE DIVISION.                                   
0001-UNICA  SECTION.                                  
     OPEN INPUT VSAMPAI.                              
       IF FS-ARQVSAM NOT EQUAL ZEROS                  
         DISPLAY 'ERRO NA ABERTURA DO ARQUIVO VSAMPAI'
         PERFORM 9999-SAIDA                           
       END-IF.                                        
         READ VSAMPAI.                                
           IF FS-ARQVSAM NOT EQUAL ZEROS              
             DISPLAY 'ERRO NA LEITURA ' FS-ARQVSAM    
           ELSE                                       
             PERFORM UNTIL FS-ARQVSAM = 10            
              DISPLAY 'DADOS ' REG-VSAMPAI            
              READ VSAMPAI                            
             END-PERFORM                              
           END-IF.
            END-IF.                       
             PERFORM 9000-FECHAVSAM.      
             PERFORM 9999-SAIDA.          
9000-FECHAVSAM                   SECTION.
    CLOSE VSAMPAI                        
      IF FS-ARQVSAM NOT EQUAL ZEROS      
        DISPLAY 'ERRO DE FECHAMENTO'     
      END-IF.                            
9999-SAIDA                 SECTION.      
    DISPLAY ' FINAL DE PROCESSAMENTO '   
    STOP RUN.                                                                           